Revit 2024 API
Document.PrintManager Property
 Retrieve the PrintManager of current project.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public PrintManager PrintManager { get; }
Visual Basic
Public ReadOnly Property PrintManager As PrintManager
	Get
Visual C++
public:
property PrintManager^ PrintManager {
	PrintManager^ get ();
}
See Also
Document Class
Autodesk.Revit.DB Namespace